In [21]:
import pandas as pd
import pickle

In [22]:
may = pd.read_csv('../data/may.csv')

In [23]:
may.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247000,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247000,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247000,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247000,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247000,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [24]:
company_dict = {'Bird':0, 'Lyft': 1, 'Gotcha': 2, 'Lime': 3, 'Spin': 4, 'Jump': 5, 'Bolt': 6}

In [25]:
may.companyname = may.companyname.replace(company_dict)

In [6]:
may.pubdatetime = pd.to_datetime(may.pubdatetime)
may.head(2)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,0
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,0

In [28]:
may = may.loc[may.sumdgroup.isin(['scooter', 'Scooter'])]

In [29]:
may = may[['pubdatetime', 'latitude', 'longitude', 'sumdid', 'chargelevel', 'companyname']]

In [30]:
may.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283582 entries, 0 to 20292502
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   chargelevel  float64
 5   companyname  int64
dtypes: float64(3), int64(1), object(2)
memory usage: 1.1+ GB

In [31]:
may = may.dropna()
may.head()

,pubdatetime,latitude,longitude,sumdid,chargelevel,companyname
0,2019-05-01 00:01:41.247000,36.136822,-86.799877,PoweredLIRL1,93.0,0
1,2019-05-01 00:01:41.247000,36.191252,-86.772945,PoweredXWRWC,35.0,0
2,2019-05-01 00:01:41.247000,36.144752,-86.806293,PoweredMEJEH,90.0,0
3,2019-05-01 00:01:41.247000,36.162056,-86.774688,Powered1A7TC,88.0,0
4,2019-05-01 00:01:41.247000,36.150973,-86.783109,Powered2TYEF,98.0,0

In [ ]:
may['hour'] = pd.to_datetime(may['pubdatetime']).dt.hour

may_by_hour = may.loc[may.groupby('hour')['sumdid'].transform('sum') >= 1].sort_values('hour')

print(may_by_day.hour(50))